Repository: AndryCU/weather_app
Catalog: lib/l10n/app_*.arb
Languages: es

# appBarSettings
source: Settings
es: Configuración

# switchGradesTitle
source: Receive values in Â°C
es: Recibir valores en °C

# switchGradeSubtitle
source: If it is activated, it receives the temperature values in degrees Celsius, otherwise it receives them in Fahrenheit.
es: Si está activado, recibe los valores de temperatura en grados Celsius, en caso contrario los recibe en Fahrenheit.

# switchInvertDaysTitle
source: Ascending/Descending
es: Ascendente/Descendente

# switchInvertSubtitle
source: If you activate this option, you will see the forecast for the next few days in ascending or descending order.
es: Si activas esta opción, verás la previsión para los próximos días en orden ascendente o descendente.

# loadingLocationText
source: Loading location...
es: Buscando localización...

source: Loading weather...
es: Cargando clima...

# gpsPermissionError
source: Please, grand the permission of location to use this feature...
es: Por favor, conceda el permiso de localización para usas esta característica.

# gpsPermissionDenyForeverText
source: Please, go to settings app screen an grand the location permission, and, Try Again
es: Por favor, vaya a la pantalla de configuración, conceda el permiso de localización e intente de nuevo.

# goAppSettingsScreen
source: Go to WeatherApp's settings
es: Ir a la configuración de WeatherApp

# enableGpsText
source: Please, enable location...
es: Por favor, active la localización

# animationText
source: Animations
es: Animaciones

# iconText
source: Icons
es: Íconos

# closedButtonText
source: Closed
es: Cerrar

# hideMessage
source: Type here a location
es: Escriba la localización

# tryAgainText
source: Try again
es: Intente de nuevo

# generalError
source: Oops. Something went wrong: {error}
es: Oops. Algo ha salido mal: {error}

# noLocationFound
source: Oops. No locations found
es: Oops. Localización no encontrada

# timeZoneMessage
source: All times are in your local time
es: Todas las horas y fechas son mostradas en su hora local
